Ran Plan for 2 projects:

1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `nz3es_gcp_stg_australia-southeast2`
1. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `nz3es_gcp_prd_australia-southeast2`
---

### 1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `nz3es_gcp_stg_australia-southeast2`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_stg_australia-southeast2...
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_stg_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_stg_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_stg_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_stg_australia-southeast2: No such file or directory

09:36:40.349 WARN   The `TERRAGRUNT_STRICT_CONTROL` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_STRICT_CONTROL=skip-dependencies-inputs,skip-dependencies-inputs` instead.
09:36:40.349 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
09:36:40.351 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.13.3` instead.
09:36:40.916 INFO   Downloading Terraform configurations from ../../../../modules/vpc into ./.terragrunt-cache/Zae8C33zkePlAzj7hHIdB7JVCuU/HG2dV7yeh55kcs3pSn2DF36Y9q4
09:36:40.961 INFO   terraform1.13.3: Initializing the backend...
09:36:41.793 INFO   terraform1.13.3: 
09:36:41.793 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
09:36:41.793 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
09:36:42.084 INFO   terraform1.13.3: Initializing provider plugins...
09:36:42.084 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
09:36:42.424 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
09:36:42.794 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
09:36:42.794 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
09:36:42.795 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
09:36:42.795 INFO   terraform1.13.3: you run "terraform init" in the future.
09:36:42.795 INFO   terraform1.13.3: ╷
09:36:42.795 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
09:36:42.795 INFO   terraform1.13.3: │ 
09:36:42.795 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
09:36:42.795 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
09:36:42.795 INFO   terraform1.13.3: │   - hashicorp/google
09:36:42.795 INFO   terraform1.13.3: │ 
09:36:42.795 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
09:36:42.795 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
09:36:42.795 INFO   terraform1.13.3: │ these providers.
09:36:42.796 INFO   terraform1.13.3: │ 
09:36:42.796 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
09:36:42.796 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
09:36:42.796 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
09:36:42.796 INFO   terraform1.13.3: ╵
09:36:42.796 INFO   terraform1.13.3: Terraform has been successfully initialized!
09:36:45.815 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:36:45.815 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:36:45.816 STDOUT terraform1.13.3:   + create
09:36:45.816 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:36:45.816 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:36:45.816 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:36:45.816 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:36:45.816 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:36:45.816 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:36:45.817 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:36:45.817 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:36:45.817 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:36:45.817 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:36:45.817 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:36:45.817 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:36:45.818 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:36:45.818 STDOUT terraform1.13.3:       + name                                      = "stg-vpc-australia-southeast2"
09:36:45.818 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:36:45.818 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:36:45.818 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:36:45.819 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:36:45.819 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:36:45.819 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:36:45.819 STDOUT terraform1.13.3:     }
09:36:45.819 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:36:45.819 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:36:45.819 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:36:45.819 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.1.0.0/24"
09:36:45.820 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:36:45.820 STDOUT terraform1.13.3:       + name                       = "stg-vpc-australia-southeast2-subnet"
09:36:45.820 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:36:45.821 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:36:45.821 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:36:45.821 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:36:45.822 STDOUT terraform1.13.3:     }
09:36:45.822 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:36:45.822 STDOUT terraform1.13.3: 
09:36:45.822 STDOUT terraform1.13.3: Changes to Outputs:
09:36:45.822 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:36:45.822 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/australia-southeast2 -w nz3es_gcp_stg_australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Faustralia-southeast2%252Fnz3es_gcp_stg_australia-southeast2)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/australia-southeast2 -w nz3es_gcp_stg_australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `nz3es_gcp_prd_australia-southeast2`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_prd_australia-southeast2...
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_prd_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_prd_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_prd_australia-southeast2: No such file or directory
find: /home/atlantis/.atlantis/repos/iac/4/nz3es_gcp_prd_australia-southeast2: No such file or directory

09:36:40.725 WARN   The `TERRAGRUNT_STRICT_CONTROL` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_STRICT_CONTROL=skip-dependencies-inputs,skip-dependencies-inputs` instead.
09:36:40.725 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
09:36:40.725 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.13.3` instead.
09:36:41.250 INFO   Downloading Terraform configurations from ../../../../modules/vpc into ./.terragrunt-cache/65oTMS93P7zoptgtxPbeEARMV_Y/JJDv7CZYD2HEOV6dfh7_vVfA1uw
09:36:41.298 INFO   terraform1.13.3: Initializing the backend...
09:36:42.015 INFO   terraform1.13.3: 
09:36:42.015 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
09:36:42.015 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
09:36:42.303 INFO   terraform1.13.3: Initializing provider plugins...
09:36:42.304 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
09:36:42.511 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
09:36:42.869 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
09:36:42.870 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
09:36:42.870 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
09:36:42.870 INFO   terraform1.13.3: you run "terraform init" in the future.
09:36:42.870 INFO   terraform1.13.3: ╷
09:36:42.870 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
09:36:42.870 INFO   terraform1.13.3: │ 
09:36:42.870 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
09:36:42.870 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
09:36:42.871 INFO   terraform1.13.3: │   - hashicorp/google
09:36:42.871 INFO   terraform1.13.3: │ 
09:36:42.871 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
09:36:42.871 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
09:36:42.871 INFO   terraform1.13.3: │ these providers.
09:36:42.871 INFO   terraform1.13.3: │ 
09:36:42.871 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
09:36:42.871 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
09:36:42.871 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
09:36:42.871 INFO   terraform1.13.3: ╵
09:36:42.872 INFO   terraform1.13.3: Terraform has been successfully initialized!
09:36:45.963 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:36:45.963 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:36:45.963 STDOUT terraform1.13.3:   + create
09:36:45.963 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:36:45.963 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:36:45.963 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:36:45.963 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:36:45.963 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:36:45.964 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:36:45.964 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:36:45.964 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:36:45.964 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:36:45.964 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:36:45.964 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:36:45.965 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:36:45.965 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:36:45.965 STDOUT terraform1.13.3:       + name                                      = "prd-vpc-australia-southeast2"
09:36:45.965 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:36:45.965 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:36:45.965 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:36:45.966 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:36:45.966 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:36:45.966 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:36:45.966 STDOUT terraform1.13.3:     }
09:36:45.966 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:36:45.966 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:36:45.966 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:36:45.966 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.0.0.0/24"
09:36:45.967 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:36:45.967 STDOUT terraform1.13.3:       + name                       = "prd-vpc-australia-southeast2-subnet"
09:36:45.968 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:36:45.968 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:36:45.968 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:36:45.968 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:36:45.968 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:36:45.968 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:36:45.968 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:36:45.968 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:36:45.969 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:36:45.969 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:36:45.969 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:36:45.969 STDOUT terraform1.13.3:     }
09:36:45.969 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:36:45.969 STDOUT terraform1.13.3: 
09:36:45.969 STDOUT terraform1.13.3: Changes to Outputs:
09:36:45.969 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:36:45.969 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/australia-southeast2 -w nz3es_gcp_prd_australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Faustralia-southeast2%252Fnz3es_gcp_prd_australia-southeast2)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/australia-southeast2 -w nz3es_gcp_prd_australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```